Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: ཡབ་ནི་སེང་གེའི་མཆེ་བ་ཞེས་བྱའོ། །
en: Lion Fangs will be his father.

source: ཡུམ་ནི་སྡོང་བུ་བྱིན་ཞེས་བྱའོ། །
en: Tree Trunk Gift will be his mother.

source: སྲས་ནི་ཆོས་སྒྲོགས་ཞེས་བྱའོ། །
en: Dharma Speaker will be his son.

source: རིམ་གྲོ་པ་ནི་ལེགས་སྤྲུལ་ཅེས་བྱའོ། །
en: Excellent Emanation will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་བྱིན་ཞེས་བྱའོ། །
en: Jewel Gift will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླས་བྱིན་ཞེས་བྱའོ། །
en: Moon Gift will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དགྲ་བཅོམ་པ་ཐེར་འབུམ་མོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་དགུའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: In the first congregation there will be one billion worthy hearers, in the second there will be nine hundred ninety million, and in the third there will be nine hundred eighty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཐེར་འབུམ་མོ། །
en: The extent of his lifespan will be one billion years.

source: དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བ་ཕྲག་བརྒྱ་ལྔ་བཅུའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for one hundred and fifty million years.

source: དེ་བཞིན་གཤེགས་པ་དོན་ཡོད་མཐོང་སྐྱེ་བའི་ཡུལ་ནི་གསལ་བ་ཅན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Amoghadarśin will be called Luminous.

source: ཡབ་ནི་དགེ་བས་བྱིན་ཞེས་བྱའོ། །
en: Virtue Gift will be his father.

source: ཡུམ་ནི་སྦྲང་རྩིའི་མིག་ཅེས་བྱའོ། །
en: Honey Eye will be his mother.

source: སྲས་ནི་སྐར་མདོག་ཅེས་བྱའོ། །
en: Star Color will be his son.

source: རིམ་གྲོ་པ་ནི་འཛམ་བུའི་ཆུ་ཀླུང་ཞེས་བྱའོ། །
en: Jambu River will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཤེས་གཉེན་སྙིང་པོ་ཞེས་བྱའོ། །
en: Essence Friend will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲང་སྲོང་བྱིན་ཞེས་བྱའོ། །
en: Given by the Sages will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་མོ། །
en: In the first congregation there will be nine hundred sixty million hearers, in the second there will be nine hundred eighty million, and in the third there will be one billion.

source: དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་སྦྱིན་སྐྱེ་བའི་ཡུལ་ནི་ཙམ་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Vīryadatta will be called Campa.

source: ཡབ་ནི་ཡེ་ཤེས་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Wisdom will be his father.

source: ཡུམ་ནི་དཔལ་བྱིན་མ་ཞེས་བྱའོ། །
en: Splendid Gift will be his mother.

source: སྲས་ནི་མྱ་ངན་མེད་ལྷ་ཞེས་བྱའོ། །
en: God Free from Suffering will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོད་པའི་རྒྱན་ཞེས་བྱའོ། །
en: Worship Ornament will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དམིགས་མེད་མཆོག་ཅེས་བྱའོ། །
en: Supreme Nonapprehension will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བའི་དཔལ་ཞེས་བྱའོ། །
en: Moon Splendor will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཅིག་སྟེ་དགྲ་བཅོམ་པ་བརྒྱད་འབུམ་མོ། །
en: There will be a single congregation consisting of eight hundred thousand worthy ones.

source: དེ་བཞིན་གཤེགས་པ་བཟང་སྐྱོང་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་རབ་སྦྱིན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Bhadrapāla will be called Gift of Joy.

source: ཡབ་ནི་རིན་ཆེན་སྐར་རྒྱལ་ཞེས་བྱའོ། །
en: Precious King of Stars will be his father.

source: སྲས་ནི་སྟག་སྦྱིན་ཞེས་བྱའོ། །
en: Tiger Gift will be his son.

source: རིམ་གྲོ་པ་ནི་རི་མཆོག་ཅེས་བྱའོ། །
en: Supreme Mountain will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་ཁྱབ་བདག་ཅེས་བྱའོ། །
en: Pervasive Lord of Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱའོ། །
en: Ocean of Intelligence will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཅིག་སྟེ། དགྲ་བཅོམ་པ་དབང་ཐོབ་པ་ཐེར་འབུམ་ཕྲག་གཅིག་དང་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །
en: There will be but a single congregation consisting of one billion eight hundred million worthy ones who have achieved mastery.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཉིས་སྟོང་ངོ་། །
en: The extent of his lifespan will be two thousand years.

source: དེ་བཞིན་གཤེགས་པ་དགའ་བོ་སྐྱེ་བའི་ཡུལ་ནི་འབྱོར་ལྡན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Nanda will be called Endowed with Riches.

source: ཡབ་ནི་ཚངས་ལྷ་ཞེས་བྱའོ། །
en: Brahmā God will be his father.

source: ཡུམ་ནི་དཔལ་རྒྱལ་ཞེས་བྱའོ། །
en: Victorious Glory will be his mother.

source: སྲས་ནི་གཟི་བརྗིད་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Splendor will be his son.

source: རིམ་གྲོ་པ་ནི་བདེ་སྟོབས་འགྲོ་ཞེས་བྱའོ། །
en: Powerful Movement of Bliss will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་ལག་ཅེས་བྱའོ། །
en: Merit Hand will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགའ་བའི་མིག་ཅེས་བྱའོ། །
en: Eye of Joy will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བདུན་དང་བྱེ་བ་ཕྲག་གསུམ་མོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བདུན་དང་བྱེ་བ་ཕྲག་གཉིས་སོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བདུན་དང་བྱེ་བ་ཕྲག་གཅིག་གོ། །
en: In the first congregation there will be seven hundred thirty million hearers, in the second there will be seven hundred twenty million, and in the third there will be seven hundred ten million.

source: དེ་བཞིན་གཤེགས་པ་འཆི་མེད་སྐྱེ་བའི་ཡུལ་ནི་རྫུ་འཕྲུལ་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Acyuta will be called Miraculous Splendor.

source: འོད་ནི་དཔག་ཚད་བདུན་ཅུའོ། །
en: His light will extend seventy leagues.

source: ཡབ་ནི་སྨན་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Doctors will be his father.

source: ཡུམ་ནི་རྒྱུ་སྐར་དཔལ་ཞེས་བྱའོ། །
en: Glorious Star will be his mother.

source: སྲས་ནི་མེ་ཏོག་ལྷ་ཞེས་བྱའོ། །
en: Flower God will be his son.

source: རིམ་གྲོ་པ་ནི་མི་ཕམ་སྟོབས་ཞེས་བྱའོ། །
en: Indomitable Strength will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་པ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Fame will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་དཔའ་བོ་ཞེས་བྱའོ། །
en: Powerful Hero will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དྲུག་གོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་ལྔ་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་ལྔ་དང་བྱེ་བ་ཕྲག་བདུན་ནོ། །
en: In the first congregation there will be six hundred million hearers, in the second there will be five hundred eighty million, and in the third there will be five hundred seventy million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཉི་ཁྲི་ཆིག་སྟོང་ངོ་། །
en: The extent of his lifespan will be twenty-one thousand years.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་རྒྱལ་མཚན་སྐྱེ་བའི་ཡུལ་ནི་མདངས་ཐོབ་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Siṃhadhvaja will be called Brightness Attained.

source: ཡབ་ནི་ཆོས་ཀྱི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Dharma Banner will be his father.

source: ཡུམ་ནི་བསོད་ནམས་བཤེས་གཉེན་ཞེས་བྱའོ། །
en: Meritorious Friend will be his mother.

source: སྲས་ནི་ཕྱུག་སྦྱིན་ཞེས་བྱའོ། །
en: Gift of Riches will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོད་པ་ཞེས་བྱའོ། །
en: Worship will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྦྱོར་བས་བྱིན་ཞེས་བྱའོ། །
en: Given by Application will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྟུལ་ཞུགས་མཛེས་ཞེས་བྱའོ། །
en: Beauty of Yogic Discipline will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་གཉིས་དང་བྱེ་བ་ཕྲག་གཉིས་སོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཉིས་དང་བྱེ་བ་ཕྲག་གཅིག་གོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཉིས་སོ། །
en: In the first congregation there will be two hundred twenty million hearers, in the second there will be two hundred ten million, and in the third there will be two hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཉི་ཁྲི་བརྒྱད་སྟོང་ངོ་། །
en: The extent of his lifespan will be twenty-eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་རྒྱལ་བ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་སྤྱོད་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Jaya will be called Jewel Conduct.

source: ཡབ་ནི་ཉི་མའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Sun Splendor will be his father.

source: ཡུམ་ནི་མེ་ཏོག་མིག་ཅེས་བྱའོ། །
en: Flower Eye will be his mother.

source: སྲས་ནི་བདེན་དགའ་ཞེས་བྱའོ། །
en: Truth Appreciator will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོས་ཅན་ཞེས་བྱའོ། །
en: Endowed with Dharma will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྟུལ་ཞུགས་བདེན་ཞེས་བྱའོ། །
en: True Yogic Discipline will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་བཟངས་ཞེས་བྱའོ། །
en: Dharma Excellence will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་བདུན་ནོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: In the first congregation there will be three hundred sixty million hearers, in the second there will be three hundred seventy million, and in the third there will be three hundred eighty million.

source: དམ་པའི་ཆོས་ནི་ལོ་འབུམ་ཕྲག་བརྒྱད་ཅུའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eight million years.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་ལྷ་དགའ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Dhārmika will be called Joyous Gods.

source: འོད་ནི་དཔག་ཚད་བདུན་ནོ། །
en: His light will extend seven leagues.

source: ཡབ་ནི་མི་ཕམ་པ་ཞེས་བྱའོ། །
en: Invincible will be his father.

source: ཡུམ་ནི་གྲགས་ལྡན་མ་ཞེས་བྱའོ། །
en: Endowed with Fame will be his mother.

source: སྲས་ནི་སྐྱེ་དབང་ལྷ་ཞེས་བྱའོ། །
en: Divine Leader will be his son.

source: རིམ་གྲོ་པ་ནི་ཉི་མས་བྱིན་ཞེས་བྱའོ། །
en: Sun Gift will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤིང་རྟ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Chariot will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྨན་སྦྱིན་ཞེས་བྱའོ། །
en: Medicine Gift will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གཉིས་པ་ལ་ནི་བྱེ་བ་ཕྲག་བདུན་ནོ། །གསུམ་པ་ལ་ནི་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: In the first congregation there will be eighty million hearers, in the second there will be seventy million, and in the third there will be eighty million.

source: དེ་བཞིན་གཤེགས་པ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་སྐྱེ་བའི་ཡུལ་ནི་འགྲོ་དོན་གྲུབ་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Prāmodyarāja will be called Aims of Beings Accomplished.

source: ཡབ་ནི་བླ་མ་ཞེས་བྱའོ། །
en: Highest will be his father.

source: ཡུམ་ནི་དཔལ་འདུན་ཅེས་བྱའོ། །
en: Glorious Aspiration will be his mother.

source: སྲས་ནི་གསེར་སྦྱིན་ཞེས་བྱའོ། །
en: Gold Gift will be his son.

source: རིམ་གྲོ་པ་ནི་བཤེས་གཉེན་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Friend will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་མཆོག་ཅེས་བྱའོ། །
en: Supreme Jewel will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་མཛེས་ཞེས་བྱའོ། །
en: Divine Beauty will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བཞིའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་བདུན་ནོ། །
en: In the first congregation there will be four hundred million hearers, in the second there will be three hundred eighty million, and in the third there will be three hundred seventy million.

source: དམ་པའི་ཆོས་ནི་ལོ་འབུམ་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for one hundred thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཁ་ལོ་སྒྱུར་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་མཛོད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Sārathi will be called Jewel Treasury.

source: ཡབ་ནི་ལེགས་སྐྱེས་ཞེས་བྱའོ། །
en: Excellent Birth will be his father.

source: ཡུམ་ནི་རིན་ཆེན་ཞེས་བྱའོ། །
en: Jewel will be his mother.

source: སྲས་ནི་བསོད་ནམས་འོད་ཅེས་བྱའོ། །
en: Light of Merit will be his son.

source: རིམ་གྲོ་པ་ནི་རྒྱ་མཚོའི་མཛོད་ཅེས་བྱའོ། །
en: Ocean Treasury will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་སྤྱོད་ཅེས་བྱའོ། །
en: Moon Conduct will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོག་སྦྱིན་ཞེས་བྱའོ། །
en: Supreme Gift will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དགུའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་མོ། །
en: In the first congregation there will be nine hundred million hearers, in the second there will be nine hundred eighty million, and in the third there will be one billion.

source: དེ་བཞིན་གཤེགས་པ་དགྱེས་པར་གཤེགས་པ་སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་མངོན་པར་དགའ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Priyaṅgama will be called World of Joy.

source: ཡབ་ནི་ཞི་བའི་བྲན་ཞེས་བྱའོ། །
en: Servant of Peace will be his father.

source: ཡུམ་ནི་དགའ་ལྡན་མ་ཞེས་བྱའོ། །
en: Endowed with Joy will be his mother.

source: སྲས་ནི་ཚངས་སྦྱིན་ཞེས་བྱའོ། །
en: Brahmā Gift will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོས་གཙོ་ཞེས་བྱའོ། །
en: Dharma Leader will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགེ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Virtue will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཆི་མེད་བྱིན་ཞེས་བྱའོ། །
en: Gift of Immortality will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་ལྔའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བཞི་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བཞི་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །
en: In the first congregation there will be five hundred million hearers, in the second there will be four hundred eighty million, and in the third there will be four hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་ཆུ་ལྷ་སྐྱེ་བའི་ཡུལ་ནི་ཡིད་བཟངས་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Varuṇa will be called Excellent Mind.

source: ཡབ་ནི་དྲང་པོར་དགའ་ཞེས་བྱའོ། །
en: Honest Joy will be his father.

source: རིམ་གྲོ་པ་ནི་ཏོག་གི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendid Crest will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲ་དགའ་ཞེས་བྱའོ། །
en: Sound of Joy will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མྱ་ངན་མེད་པ་ཞེས་བྱའོ། །
en: Freedom from Suffering will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་ཕྲག་བདུན་ཅུའོ། །གཉིས་པ་ལ་ནི་བྱེ་བ་བརྒྱ་ཕྲག་དྲུག་ཅུའོ། །གསུམ་པ་ལ་ནི་བྱེ་བ་བརྒྱ་ཕྲག་ལྔ་བཅུའོ། །
en: In the first congregation there will be seven hundred million hearers, in the second there will be sixty billion, and in the third there will be fifty billion.

source: དམ་པའི་ཆོས་ནི་ལོ་ཉི་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for twenty thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཡན་ལག་སྐྱེ་བའི་ཡུལ་ནི་སྤོས་ལྡན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Guṇabāhu will be called Endowed with Incense.

source: ཡུམ་ནི་གཟི་བརྗིད་ཕུང་པོ་ཞེས་བྱའོ། །
en: Splendid Hill will be his mother.

source: སྲས་ནི་སྐར་རྒྱལ་ཞེས་བྱའོ། །
en: Star King will be his son.

source: རིམ་གྲོ་པ་ནི་ཨུད་པ་ལ་ཞེས་བྱའོ། །
en: Utpala will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲི་མེད་བྱིན་ཞེས་བྱའོ། །
en: Stainless Gift will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགའ་བས་བྱིན་ཞེས་བྱའོ། །
en: Gift of Joy will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བཞིའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: In the first congregation there will be one hundred forty million hearers, in the second there will be one hundred sixty million, and in the third there will be one hundred eighty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཉི་ཁྲི་ལྔ་སྟོང་ངོ་། །
en: The extent of his lifespan will be twenty-five thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་གླང་པོ་སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་སྤོས་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Gandhahastin will be called Meritorious Incense.

source: ཡབ་ནི་སྤོས་དཔལ་ཞེས་བྱའོ། །
en: Glorious Incense will be his father.

source: ཡུམ་ནི་མེ་ཏོག་ཕུང་པོ་ཞེས་བྱའོ། །
en: Flower Hill will be his mother.

source: སྲས་ནི་དགའ་བའི་འོད་ཅེས་བྱའོ། །
en: Light of Joy will be his son.

source: རིམ་གྲོ་པ་ནི་བདེན་པའི་ཏོག་ཅེས་བྱའོ། །
en: Truth Crest will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བ་དགའ་བ་ཞེས་བྱའོ། །
en: Joyous Moon will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོབས་ཐུབ་ཅེས་བྱའོ། །
en: Capable Strength will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དྲུག་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དྲུག་དང་བྱེ་བ་ཕྲག་བཞིའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དྲུག་དང་བྱེ་བ་ཕྲག་གཉིས་སོ། །
en: In the first congregation there will be six hundred sixty million hearers, in the second there will be six hundred forty million, and in the third there will be six hundred twenty million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་བདུན་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for seventy thousand years.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་སྐྱེ་བའི་ཡུལ་ནི་ཙམ་པ་མཆོག་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Vilocana will be called Supreme Campaka.

source: ཡབ་ནི་གཟུགས་བྱིན་ཞེས་བྱའོ། །
en: Form Gift will be his father.

source: ཡུམ་ནི་རིན་ཆེན་འཕགས་མ་ཞེས་བྱའོ། །
en: Superior Jewel will be his mother.

source: སྲས་ནི་སྐྱེ་བ་པོ་ཞེས་བྱའོ། །
en: Man will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྣང་བ་བྱིན་ཞེས་བྱའོ། །
en: Gift of Illumination will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་སྣ་ཚོགས་ཞེས་བྱའོ། །
en: Diverse Intelligence will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དྲུག་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དྲུག་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །
en: In the first congregation there will be seven hundred million hearers, in the second there will be six hundred eighty million, and in the third there will be six hundred sixty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དུང་ཕྱུར་ཕྲག་དགུའོ། །
en: The extent of his lifespan will be nine hundred million years.

source: དམ་པའི་ཆོས་ནི་ལོ་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་དགུའོ། །
en: His sacred Dharma will remain for nine hundred ninety million years.

source: དེ་བཞིན་གཤེགས་པ་འབྲུག་སྒྲ་སྐྱེ་བའི་ཡུལ་ནི་གནས་དགའ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Meghasvara will be called Joyous Abode.

source: འོད་ནི་དཔག་ཚད་བཞི་བཅུ་རྩ་བཞིའོ། །
en: His light will extend forty-four leagues.

source: ཡབ་ནི་གློག་མཆོག་ཅེས་བྱའོ། །
en: Supreme Lightning will be his father.

source: ཡུམ་ནི་གཟི་བྱིན་ཕུང་པོ་ཞེས་བྱའོ། །
en: Splendid Hill will be his mother.

source: སྲས་ནི་ཆོས་ཅན་ཞེས་བྱའོ། །
en: Endowed with Dharma will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Moon Essence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་སྟོབས་ཞེས་བྱའོ། །
en: Powerful Strength will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བདུན་དང་བྱེ་བ་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །
en: In the first congregation there will be seven hundred million hearers, in the second there will be seven hundred fifty million, and in the third there will be eight hundred million.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་སེམས་སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་མཐའ་ཡས་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Sucintita will be called Limitless Jewels.

source: ཡབ་ནི་སེམས་བརྟན་ཞེས་བྱའོ། །
en: Stable Mind will be his father.

source: ཡུམ་ནི་བསོད་ནམས་ལྡན་ཞེས་བྱའོ། །
en: Endowed with Merit will be his mother.

source: སྲས་ནི་མེ་ཏོག་སྦྱིན་ཞེས་བྱའོ། །
en: Flower Gift will be his son.

source: རིམ་གྲོ་པ་ནི་སྟོབས་སྦྱིན་ཞེས་བྱའོ། །
en: Gift of Strength will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དཔེ་མེད་ཅེས་བྱའོ། །
en: Incomparable will be foremost in terms of insight.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་འབུམ་མོ། །གཉིས་པ་ལ་ནི་བརྒྱད་ཁྲིའོ། །གསུམ་པ་ལ་ནི་ས་ཡ་ཕྲག་བདུན་ནོ། །
en: In the first congregation there will be one hundred thousand hearers, in the second there will be eighty thousand, and in the third there will be seven million.

source: དེ་བཞིན་གཤེགས་པ་ཡིད་བཟངས་སྐྱེ་བའི་ཡུལ་ནི་བལྟ་ན་སྡུག་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Sumanas will be called Beautiful to See.

source: འོད་ནི་དཔག་ཚད་བཅུ་བཞིའོ། །
en: His light will extend fourteen leagues.

source: ཡབ་ནི་ནོར་ལྷ་ཞེས་བྱའོ། །
en: Wealth God will be his father.

source: སྲས་ནི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོག་བདེན་ཞེས་བྱའོ། །
en: Supreme Truth will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སོ་མཉམ་ཞེས་བྱའོ། །
en: Evenness will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟབས་ཀྱིས་འགྲོ་ཞེས་བྱའོ། །
en: Moving with Strength will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་གཉིས་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཉིས་དང་བྱེ་བ་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཉིས་དང་བྱེ་བ་ཕྲག་གསུམ་མོ། །
en: In the first congregation there will be two hundred eighty million hearers, in the second there will be two hundred fifty million, and in the third there will be two hundred thirty million.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྐྱེ་བའི་ཡུལ་ནི་ནོར་ཅན་གཟི་ལྡན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Vimala will be called Possessing Wealth and Splendor.

source: འོད་ནི་དཔག་ཚད་ཉི་ཤུ་རྩ་བརྒྱད་དོ། །
en: His light will extend twenty-eight leagues.

source: ཡབ་ནི་དཔལ་གྱི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Glorious Essence will be his father.

source: ཡུམ་ནི་མེ་ཏོག་འོད་ཅེས་བྱའོ། །
en: Flower Light will be his mother.

source: སྲས་ནི་གཟི་བརྗིད་གྱ་ནོམ་ཞེས་བྱའོ། །
en: Splendid Excellence will be his son.

source: རིམ་གྲོ་པ་ནི་མཚུངས་མེད་ཅེས་བྱའོ། །
en: Incomparable will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ས་རི་ཞེས་བྱའོ། །
en: Earth Mountain will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མགུ་བ་ཅན་ཞེས་བྱའོ། །
en: Delightful will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བརྒྱད་ཁྲིའོ། །གཉིས་པ་ལ་ནི་དགུ་ཁྲིའོ། །གསུམ་པ་ལ་ནི་འབུམ་མོ། །
en: In the first congregation there will be eighty thousand hearers, in the second there will be ninety thousand, and in the third there will be one hundred thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དྲུག་ཁྲི་ལྔ་སྟོང་ངོ་། །
en: The extent of his lifespan will be sixty-five thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྐྱེ་བའི་ཡུལ་ནི་མྱ་ངན་མེད་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Śaśin will be called Free from Suffering.

source: ཡུམ་ནི་དཔལ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Glory will be his mother.

source: སྲས་ནི་གཟི་བརྗིད་བྱིན་ཞེས་བྱའོ། །
en: Gift of Splendor will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོས་འཕགས་ཞེས་བྱའོ། །
en: Superior Dharma will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རི་བོ་ཞེས་བྱའོ། །
en: Mountain will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲང་སྲོང་དགའ་བ་ཞེས་བྱའོ། །
en: Joy of the Sages will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཐེར་འབུམ་མོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །
en: In the first congregation there will be one billion hearers, in the second there will be nine hundred million, and in the third there will be eight hundred million.

source: དམ་པའི་ཆོས་ནི་ལོ་ས་ཡ་ཕྲག་གཉིས་ཀྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for two million years.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་ཆེན་སྐྱེ་བའི་ཡུལ་ནི་དམིགས་པ་དགའ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Mahāyaśas will be called Joyous Focus.

source: ཡབ་ནི་དཔལ་བརྩེགས་ཞེས་བྱའོ། །
en: Heap of Glory will be his father.

source: སྲས་ནི་ཡིད་གཉིས་སྤོང་ཞེས་བྱའོ། །
en: Abandoning Doubt will be his son.

source: རིམ་གྲོ་པ་ནི་ཐོས་པའི་དོན་སེམས་ཞེས་བྱའོ། །
en: Attentive to Meanings Heard will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡུལ་འཁོར་དགའ་ཞེས་བྱའོ། །
en: Land of Joy will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཁྲོན་པ་བྱིན་ཞེས་བྱའོ། །
en: Wellspring Gift will be foremost in terms of miraculous abilities.
